In [40]:
import numpy as np

yeni_dizi = np.random.randint(0, 25, (4, 3))

print(rnd)

[44 49 43 40 18 28 43 14 19 22 37  1]

In [35]:
import pandas as pd
seri2=pd.Series(rnd)
seri2

0     44
1     49
2     43
3     40
4     18
5     28
6     43
7     14
8     19
9     22
10    37
11     1
dtype: int32

In [38]:
seri2.index=[ "a","b","c","d","e","f","x1","x2","x3","x4","x5","x6"]
seri2

a     44
b     49
c     43
d     40
e     18
f     28
x1    43
x2    14
x3    19
x4    22
x5    37
x6     1
dtype: int32

In [37]:
pd.DataFrame(seri2,columns=["Sayilar"])

    Sayilar
0        44
1        49
2        43
3        40
4        18
5        28
6        43
7        14
8        19
9        22
10       37
11        1

In [44]:
yeni_dizi = np.random.randint(25, size = (4,3))
df = pd.DataFrame(yeni_dizi, columns = ["col1", "col2", "col3"])
print(df)

   col1  col2  col3
0    16    14     5
1     3    16     9
2    18    11     0
3    21    23    16

In [45]:
a = np.random.randint(10, size=5)
b = np.random.randint(10, size=5)
c = np.random.randint(10, size=5)
sozluk = {
    "col1": a,
    "col2": b,
    "col3": c,
}
print(sozluk)

{'col1': array([7, 0, 8, 1, 5]), 'col2': array([5, 8, 1, 0, 3]), 'col3': array([2, 9, 6, 5, 1])}

In [48]:
df=pd.DataFrame(sozluk)
df

   col1  col2  col3
0     7     5     2
1     0     8     9
2     8     1     6
3     1     0     5
4     5     3     1

In [49]:
df[0:3]

   col1  col2  col3
0     7     5     2
1     0     8     9
2     8     1     6

In [60]:
df.head(3)

   col1  col2  col3
0     7     5     2
1     0     8     9
2     8     1     6

In [64]:
df[1:-1][["col1","col3"]]

   col1  col3
1     0     9
2     8     6
3     1     5

In [71]:
df.drop(1,axis=0)

   col1  col2  col3
0     7     5     2
2     8     1     6
3     1     0     5
4     5     3     1

In [72]:
df

   col1  col2  col3
0     7     5     2
1     0     8     9
2     8     1     6
3     1     0     5
4     5     3     1